kodediy/kode-dot/2-Firmware/ConfiguracionesBoard/kodedot/hardware/kodedot/0.1/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################
esp32s3.name=kode.1

# Herramientas de carga (upload tools)
esp32s3.bootloader.tool=esptool_py
esp32s3.bootloader.tool.default=esptool_py

esp32s3.upload.tool=esptool_py
esp32s3.upload.tool.default=esptool_py
esp32s3.upload.tool.network=esp_ota

# Tamaño máximo de memoria para cargar el binario
esp32s3.upload.maximum_size=1310720
esp32s3.upload.maximum_data_size=327680
esp32s3.upload.flags=
esp32s3.upload.extra_flags=
esp32s3.upload.use_1200bps_touch=false
esp32s3.upload.wait_for_upload_port=false
esp32s3.upload.speed=921600

# Sobrescribir el valor de upload.erase_cmd para evitar el borrado de memoria
esp32s3.upload.erase_cmd= 

# Definición del offset y carga del binario directamente a la dirección 0x220000
esp32s3.upload.pattern_args=--chip {build.mcu} --port "{serial.port}" --baud {upload.speed} --before default_reset --after hard_reset write_flash --flash_mode dio --flash_freq 80m --flash_size 4MB 0x220000 "{build.path}/{build.project_name}.bin"
esp32s3.upload.pattern="{runtime.tools.esptool_py.path}/esptool" {upload.pattern_args}

# Configuraciones del puerto serie
esp32s3.serial.disableDTR=false
esp32s3.serial.disableRTS=false

# Definición de la arquitectura, procesador, y variante de la placa
esp32s3.build.tarch=xtensa
esp32s3.build.target=esp32s3
esp32s3.build.mcu=esp32s3
esp32s3.build.core=esp32
esp32s3.build.variant=kode.1
esp32s3.build.board=ESP32S3_DEV

# Configuraciones del flash
esp32s3.build.flash_size=4MB  
esp32s3.build.flash_freq=80m
esp32s3.build.flash_mode=dio
esp32s3.build.bootloader_addr=0x1000 

# Parámetros del procesador y memoria
esp32s3.build.usb_mode=1
esp32s3.build.cdc_on_boot=1
esp32s3.build.msc_on_boot=0
esp32s3.build.dfu_on_boot=0
esp32s3.build.f_cpu=240000000L
esp32s3.build.partitions=kodedot_partitions

# PSRAM y memoria adicionales
esp32s3.build.defines=-DBOARD_HAS_PSRAM
esp32s3.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32s3.build.psram_type=qspi
esp32s3.build.memory_type={build.boot}_{build.psram_type}
esp32s3.build.code_debug=5

# Configuraciones adicionales (JTAG, Zigbee deshabilitado)
esp32s3.build.copy_jtag_files=0
esp32s3.build.zigbee_mode=
esp32s3.build.zigbee_libs=
##############################################################
